tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
#include "IrrigationWeb.h"

#include <ArduinoJson.h>
#include <Esp32Base.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "BoardHardware.h"
#include "CalibrationService.h"
#include "ConfigStore.h"
#include "HistoryService.h"
#include "IrrigationConfig.h"
#include "PlanService.h"
#include "RunController.h"
#include "ZoneService.h"

namespace Irrigation {

namespace {

char g_historyViewBuffer[24576];

void sendIrrigationHeadExtra() {
    Esp32BaseWeb::sendChunk(
        "<style>"
        ":root{--ir-accent:#0f7b61;--ir-accent-strong:#08634e;--ir-soft:#edf7f3;--ir-ink:#1d2935;--ir-muted:#637083;--ir-line:#d9e2e7;--ir-bg:#f5f7f8;--ir-card:#fff}"
        "body{background:var(--ir-bg);color:var(--ir-ink)}"
        ".topbar{border-bottom:1px solid #dce5e8;background:rgba(255,255,255,.94);backdrop-filter:blur(10px)}"
        "nav a{border-radius:7px;font-weight:650}nav a.active{background:var(--ir-soft);color:var(--ir-accent-strong)}nav a.brand{font-size:0}nav a.brand:after{content:'首页';font-size:14px}"
        ".page{max-width:1180px}.pagehead{border:1px solid var(--ir-line);background:linear-gradient(135deg,#fff 0%,#f4faf7 100%);border-radius:8px;padding:16px 18px;box-shadow:0 1px 2px rgba(16,24,40,.04)}"
        ".pagehead h1{font-size:22px;letter-spacing:0}.pagehead p{font-size:13px;color:var(--ir-muted)}"
        ".panel{border:1px solid var(--ir-line);border-radius:8px;background:var(--ir-card);box-shadow:0 1px 2px rgba(16,24,40,.04)}"
        ".panel h2{font-size:16px;margin-bottom:10px}.metrics{gap:10px}.metric{border:1px solid var(--ir-line);border-radius:8px;background:#fff;padding:12px}.metric b{font-size:20px}"
        ".actions{gap:8px;justify-content:flex-end}button,input[type=submit],input[type=button],.btnlink{border-radius:7px;font-weight:700;min-height:34px;padding:0 14px}"
        "input:not([type]),input[type=text],input[type=number],input[type=time],select{border:1px solid #cbd6de;border-radius:7px;background:#fff;color:var(--ir-ink);min-height:36px;padding:6px 9px;box-sizing:border-box}"
        "input[type=number]{font-variant-numeric:tabular-nums}select{min-width:180px}.tablewrap{border:1px solid var(--ir-line);border-radius:8px;background:#fff}table{font-size:13px}th{color:var(--ir-muted);font-weight:700}"
        ".ir-grid{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:12px}.ir-grid.ir-three{grid-template-columns:repeat(3,minmax(0,1fr))}"
        ".ir-card{border:1px solid var(--ir-line);border-radius:8px;background:#fff;padding:13px;min-width:0}.ir-card-head{display:flex;align-items:flex-start;justify-content:space-between;gap:12px;margin-bottom:10px}.ir-card-title{font-size:15px;font-weight:800;color:var(--ir-ink)}.ir-card-note{margin:3px 0 0;color:var(--ir-muted);font-size:12px;line-height:1.45}"
        ".ir-empty{border:1px dashed #cbd6de;border-radius:8px;background:#fbfcfd;color:var(--ir-muted);padding:14px;text-align:center}"
        ".ir-form{display:block;max-width:none;margin:0}.ir-card.ir-form{display:block}.ir-section{margin:0 0 14px;border:1px solid #e4ebef;border-radius:8px;background:#fbfcfd;padding:13px}.ir-section:last-child{margin-bottom:0}.ir-section-title{font-size:15px;font-weight:800;margin:0 0 2px}.ir-section-note{margin:0 0 12px;color:var(--ir-muted);font-size:12px}"
        ".ir-setting-list{display:grid;grid-template-columns:repeat(auto-fit,minmax(250px,1fr));gap:10px}.ir-setting{border:1px solid #e4ebef;border-radius:8px;background:#fff;padding:12px;min-width:0}.ir-setting-title{display:block;font-weight:800;color:var(--ir-ink)}.ir-setting-desc{display:block;margin-top:4px;color:var(--ir-muted);font-size:12px;line-height:1.45}.ir-control{display:flex;align-items:center;justify-content:flex-start;gap:7px;min-width:0;margin-top:10px}.ir-control input[type=number],.ir-control input[type=time],.ir-control input:not([type]),.ir-control input[type=text]{width:100%;max-width:210px}.ir-unit{flex:0 0 auto;color:var(--ir-muted);font-size:12px;font-weight:700;white-space:nowrap}"
        ".ir-toggle{position:relative;display:inline-flex;align-items:center;cursor:pointer;user-select:none}.ir-toggle input{position:absolute;opacity:0;pointer-events:none}.ir-toggle span{position:relative;display:inline-flex;align-items:center;justify-content:flex-end;width:74px;height:32px;padding:0 10px;border-radius:999px;background:#eef2f4;color:#667085;font-size:12px;font-weight:800;transition:.16s;box-sizing:border-box}.ir-toggle span:before{content:'';position:absolute;left:4px;top:4px;width:24px;height:24px;border-radius:50%;background:#fff;box-shadow:0 1px 3px rgba(16,24,40,.24);transition:.16s}.ir-toggle span:after{content:'禁用'}.ir-toggle input:checked+span{justify-content:flex-start;background:#dff4e8;color:#087443}.ir-toggle input:checked+span:before{transform:translateX(42px)}.ir-toggle input:checked+span:after{content:'启用'}"
        ".ir-choice{display:inline-grid;grid-auto-flow:column;grid-auto-columns:1fr;align-items:center;height:40px;box-sizing:border-box;border:1px solid #cbd6de;border-radius:8px;background:#f4f7f8;padding:3px;gap:3px;min-width:176px;vertical-align:middle}.ir-choice label{position:relative;display:flex;align-items:center;justify-content:center;height:32px;box-sizing:border-box;margin:0;padding:0 12px;border-radius:6px;font-size:12px;font-weight:800;line-height:1;color:#667085;cursor:pointer;white-space:nowrap}.ir-choice input{position:absolute;opacity:0;pointer-events:none}.ir-choice label:has(input:checked){background:#fff;color:var(--ir-accent-strong);box-shadow:0 1px 2px rgba(16,24,40,.12)}"
        ".ir-field{display:grid;gap:4px;margin:0 0 10px}.ir-field label{font-weight:800;margin:0}.ir-help{color:var(--ir-muted);font-size:12px;line-height:1.45}.ir-input-unit{display:flex;align-items:center;gap:7px}.ir-input-unit input{flex:1 1 auto;min-width:0}.ir-input-unit .ir-unit{padding-right:2px}"
        ".ir-run-list{display:grid;grid-template-columns:repeat(auto-fit,minmax(210px,1fr));gap:10px}.ir-run-row{border:1px solid #e4ebef;border-radius:8px;padding:12px;background:#fbfcfd;min-width:0}.ir-run-row b{display:block}.ir-run-row .ir-help{display:block;margin-top:4px}.ir-run-row .ir-input-unit{margin-top:12px}.ir-run-row input[type=number]{max-width:110px}.ir-badge{display:inline-flex;align-items:center;min-height:22px;padding:0 8px;border-radius:999px;background:var(--ir-soft);color:var(--ir-accent-strong);font-size:12px;font-weight:800}"
        ".ir-toolbar{display:flex;justify-content:space-between;align-items:center;gap:10px;margin:0 0 10px}.ir-toolbar p{margin:0;color:var(--ir-muted);font-size:13px}.ir-list-main b{display:block}.ir-list-main small,.ir-list-cell small{display:block;color:var(--ir-muted);font-size:12px;margin-top:2px}.ir-list-cell{font-size:13px}.ir-pill{display:inline-flex;align-items:center;min-height:24px;padding:0 9px;border-radius:999px;font-size:12px;font-weight:800;white-space:nowrap;background:#eef2f4;color:#667085}.ir-pill.on{background:#dff4e8;color:#087443}.ir-pill.warn{background:#fff4d6;color:#935b00}.ir-kv{display:grid;grid-template-columns:repeat(4,minmax(0,1fr));gap:8px}.ir-kv div{border:1px solid #e4ebef;border-radius:8px;background:#fbfcfd;padding:10px}.ir-kv b{display:block;font-size:18px}.ir-kv span{display:block;margin-top:2px;color:var(--ir-muted);font-size:12px}"
        ".ir-data-table{width:100%;border-collapse:separate;border-spacing:0}.ir-data-table th,.ir-data-table td{padding:11px 12px;border-bottom:1px solid #e4ebef;vertical-align:middle;text-align:left}.ir-data-table th{font-size:12px;background:#f8fafb;color:var(--ir-muted);white-space:nowrap}.ir-data-table tbody tr:last-child td{border-bottom:0}.ir-data-table tbody tr:hover td{background:#fbfcfd}.ir-data-table .num{text-align:right;font-variant-numeric:tabular-nums}.ir-table-title{font-weight:800;color:var(--ir-ink)}.ir-table-note{display:block;margin-top:3px;color:var(--ir-muted);font-size:12px}.ir-compact-list{display:flex;flex-wrap:wrap;gap:5px}.ir-compact-item{display:inline-flex;align-items:center;min-height:22px;padding:0 7px;border-radius:6px;background:#eef6f3;color:#236052;font-size:12px;font-weight:700;white-space:nowrap}"
        ".ir-time-grid{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:8px}.ir-time-item{display:grid;grid-template-columns:auto minmax(0,1fr);gap:8px;align-items:center;border:1px solid #e4ebef;border-radius:8px;background:#fff;padding:8px}.ir-time-item input[type=time]{width:100%}.ir-zone-duration{display:grid;grid-template-columns:repeat(auto-fit,minmax(190px,1fr));gap:8px}.ir-zone-duration .ir-field{border:1px solid #e4ebef;border-radius:8px;background:#fff;padding:10px;margin:0}.ir-zone-duration input[type=number]{max-width:100px}.ir-danger-line{display:flex;justify-content:flex-end;margin-top:8px}"
        ".ir-calib-flow{display:grid;grid-template-columns:minmax(0,.9fr) minmax(0,1.1fr);gap:12px}.ir-calib-card{border:1px solid #e4ebef;border-radius:8px;background:#fff;padding:13px}.ir-calib-card h3{margin:0 0 4px;font-size:15px}.ir-calib-card p{margin:0 0 12px;color:var(--ir-muted);font-size:12px;line-height:1.45}.ir-calib-steps{display:grid;gap:8px}.ir-calib-step{display:grid;grid-template-columns:28px minmax(0,1fr);gap:9px;align-items:start}.ir-step-no{display:flex;align-items:center;justify-content:center;width:24px;height:24px;border-radius:50%;background:var(--ir-soft);color:var(--ir-accent-strong);font-size:12px;font-weight:900}.ir-calib-result{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:8px;margin-bottom:12px}.ir-calib-result div{border:1px solid #e4ebef;border-radius:8px;background:#fbfcfd;padding:10px}.ir-calib-result b{display:block;font-size:18px}.ir-calib-result span{display:block;margin-top:2px;color:var(--ir-muted);font-size:12px}"
        "@media(max-width:820px){.ir-grid,.ir-grid.ir-three,.ir-time-grid,.ir-zone-duration,.ir-kv,.ir-setting-list,.ir-run-list,.ir-calib-flow,.ir-calib-result{grid-template-columns:1fr}.actions,.ir-toolbar{justify-content:flex-start;align-items:flex-start}.ir-toolbar{flex-direction:column}select{width:100%;min-width:0}.tablewrap{overflow-x:auto}.ir-data-table{min-width:680px}}"
        "</style>");
}

const char* runStateName(RunState state) {
    switch (state) {
        case RunState::Idle: return "idle";
        case RunState::Precheck: return "precheck";
        case RunState::OpenValve: return "open_valve";
        case RunState::PumpSignalOn: return "pump_signal_on";
        case RunState::PumpStartDelay: return "pump_start_delay";
        case RunState::FlowGrace: return "flow_grace";
        case RunState::Running: return "running";
        case RunState::PumpSignalOff: return "pump_signal_off";
        case RunState::PumpStopDelay: return "pump_stop_delay";
        case RunState::CloseValve: return "close_valve";
        case RunState::AdvanceStep: return "advance_step";
        case RunState::Finished: return "finished";
    }
    return "unknown";
}

const char* runStateLabel(RunState state) {
    switch (state) {
        case RunState::Idle: return "空闲";
        case RunState::Precheck: return "运行前检查";
        case RunState::OpenValve: return "打开水路";
        case RunState::PumpSignalOn: return "启动自吸泵信号";
        case RunState::PumpStartDelay: return "启动稳定时间";
        case RunState::FlowGrace: return "等待流量稳定";
        case RunState::Running: return "浇水中";
        case RunState::PumpSignalOff: return "关闭自吸泵信号";
        case RunState::PumpStopDelay: return "自吸泵停止延时";
        case RunState::CloseValve: return "关闭水路";
        case RunState::AdvanceStep: return "切换下一水路";
        case RunState::Finished: return "已结束";
    }
    return "未知";
}

const char* runResultName(RunResult result) {
    switch (result) {
        case RunResult::None: return "none";
        case RunResult::Completed: return "completed";
        case RunResult::UserStopped: return "user_stopped";
        case RunResult::FaultStopped: return "fault_stopped";
        case RunResult::Skipped: return "skipped";
    }
    return "unknown";
}

const char* runReasonLabel(RunReason reason) {
    switch (reason) {
        case RunReason::None: return "无";
        case RunReason::ManualRequest: return "手动启动";
        case RunReason::PlanStartTime: return "计划时间启动";
        case RunReason::RunPlanNow: return "立即执行计划";
        case RunReason::CalibrationRequest: return "校准启动";
        case RunReason::UserStop: return "用户停止";
        case RunReason::NoEffectiveStep: return "没有有效浇水水路";
        case RunReason::ControllerBusy: return "控制器正在运行";
        case RunReason::PlanDisabled: return "计划未启用";
        case RunReason::ZoneDisabled: return "水路未启用";
        case RunReason::InvalidDuration: return "时长无效";
        case RunReason::ConfigInvalid: return "配置无效";
        case RunReason::FlowNotCalibrated: return "流量计未校准";
        case RunReason::TimeInvalid: return "系统时间无效";
        case RunReason::NoFlow: return "未检测到流量";
        case RunReason::LowLevel: return "低液位保护";
        case RunReason::RebootRecoveredSafe: return "重启后安全恢复";
    }
    return "未知原因";
}

const char* runSourceLabelFromString(const char* source) {
    if (source == nullptr) {
        return "未知";
    }
    if (strcmp(source, "manual") == 0) {
        return "手动浇水";
    }
    if (strcmp(source, "plan") == 0) {
        return "自动计划";
    }
    if (strcmp(source, "run_plan_now") == 0) {
        return "立即执行计划";
    }
    if (strcmp(source, "calibration") == 0) {
        return "校准";
    }
    return "未知";
}

const char* runResultLabelFromString(const char* result) {
    if (result == nullptr) {
        return "未知";
    }
    if (strcmp(result, "none") == 0) {
        return "无";
    }
    if (strcmp(result, "completed") == 0) {
        return "已完成";
    }
    if (strcmp(result, "user_stopped") == 0) {
        return "用户停止";
    }
    if (strcmp(result, "fault_stopped") == 0) {
        return "故障停止";
    }
    if (strcmp(result, "skipped") == 0) {
        return "已跳过";
    }
    return "未知";
}

const char* runReasonLabelFromString(const char* reason) {
    if (reason == nullptr) {
        return "未知";
    }
    if (strcmp(reason, "none") == 0) return "无";
    if (strcmp(reason, "manual_request") == 0) return "手动启动";
    if (strcmp(reason, "plan_start_time") == 0) return "计划时间启动";
    if (strcmp(reason, "run_plan_now") == 0) return "立即执行计划";
    if (strcmp(reason, "calibration_request") == 0) return "校准启动";
    if (strcmp(reason, "user_stop") == 0) return "用户停止";
    if (strcmp(reason, "no_effective_step") == 0) return "没有有效浇水水路";
    if (strcmp(reason, "controller_busy") == 0) return "控制器正在运行";
    if (strcmp(reason, "plan_disabled") == 0) return "计划未启用";
    if (strcmp(reason, "zone_disabled") == 0) return "水路未启用";
    if (strcmp(reason, "invalid_duration") == 0) return "时长无效";
    if (strcmp(reason, "config_invalid") == 0) return "配置无效";
    if (strcmp(reason, "flow_not_calibrated") == 0) return "流量计未校准";
    if (strcmp(reason, "time_invalid") == 0) return "系统时间无效";
    if (strcmp(reason, "no_flow") == 0) return "未检测到流量";
    if (strcmp(reason, "low_level") == 0) return "低液位保护";
    if (strcmp(reason, "reboot_recovered_safe") == 0) return "重启后安全恢复";
    return "未知原因";
}

const char* eventLevelLabel(uint8_t level) {
    switch (level) {
        case Esp32BaseAppEventLog::LEVEL_INFO: return "信息";
        case Esp32BaseAppEventLog::LEVEL_WARN: return "警告";
        case Esp32BaseAppEventLog::LEVEL_ERROR: return "错误";
    }
    return "未知";
}

