tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
const char* eventSourceLabel(const char* source) {
    if (source == nullptr) return "未知";
    if (strcmp(source, "system") == 0) return "系统";
    if (strcmp(source, "run") == 0) return "运行";
    if (strcmp(source, "plan") == 0) return "计划";
    if (strcmp(source, "calibration") == 0) return "校准";
    if (strcmp(source, "flow") == 0) return "流量";
    if (strcmp(source, "zone") == 0) return "水路";
    return source;
}

const char* eventTypeLabel(const char* type) {
    if (type == nullptr) return "未知";
    if (strcmp(type, "startup") == 0) return "启动";
    if (strcmp(type, "started") == 0) return "已启动";
    if (strcmp(type, "finished") == 0) return "已结束";
    if (strcmp(type, "completed") == 0) return "已完成";
    if (strcmp(type, "user_stopped") == 0) return "用户停止";
    if (strcmp(type, "fault_stopped") == 0) return "故障停止";
    if (strcmp(type, "saved") == 0) return "已保存";
    if (strcmp(type, "triggered") == 0) return "已触发";
    if (strcmp(type, "skipped") == 0) return "已跳过";
    if (strcmp(type, "leak") == 0) return "疑似漏水";
    if (strcmp(type, "low_flow") == 0) return "低流量";
    if (strcmp(type, "high_flow") == 0) return "高流量";
    return type;
}

const char* eventReasonLabel(const char* reason) {
    if (reason == nullptr || reason[0] == '\0') return "无";
    if (strcmp(reason, "boot") == 0) return "开机";
    if (strcmp(reason, "request") == 0) return "用户请求";
    if (strcmp(reason, "start_time") == 0) return "启动时间";
    if (strcmp(reason, "idle_flow") == 0) return "待机流量";
    if (strcmp(reason, "flow_meter_volume") == 0) return "流量计水量校准";
    if (strcmp(reason, "zone_standard_flow") == 0) return "水路标准流量校准";
    const char* runReason = runReasonLabelFromString(reason);
    return strcmp(runReason, "未知原因") == 0 ? reason : runReason;
}

const char* calibrationModeName(CalibrationMode mode) {
    switch (mode) {
        case CalibrationMode::None: return "none";
        case CalibrationMode::FlowMeterVolume: return "flow_meter_volume";
        case CalibrationMode::ZoneStandardFlow: return "zone_standard_flow";
    }
    return "unknown";
}

const char* calibrationModeLabel(CalibrationMode mode) {
    switch (mode) {
        case CalibrationMode::None: return "无";
        case CalibrationMode::FlowMeterVolume: return "流量计水量校准";
        case CalibrationMode::ZoneStandardFlow: return "水路标准流量校准";
    }
    return "未知";
}

void sendJsonStringField(const char* name, const char* value, bool comma = true) {
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("\":\"");
    Esp32BaseWeb::writeJsonEscaped(value != nullptr ? value : "");
    Esp32BaseWeb::sendChunk(comma ? "\"," : "\"");
}

bool parseBoolParam(const char* name) {
    char value[8];
    if (!Esp32BaseWeb::getParam(name, value, sizeof(value))) {
        return false;
    }
    return strcmp(value, "1") == 0 || strcmp(value, "on") == 0 || strcmp(value, "true") == 0;
}

bool parseU32Param(const char* name, uint32_t minValue, uint32_t maxValue, uint32_t fallback, uint32_t& out) {
    char value[16];
    if (!Esp32BaseWeb::getParam(name, value, sizeof(value)) || value[0] == '\0') {
        out = fallback;
        return true;
    }
    char* end = nullptr;
    const unsigned long parsed = strtoul(value, &end, 10);
    if (end == value || *end != '\0' || parsed < minValue || parsed > maxValue) {
        return false;
    }
    out = static_cast<uint32_t>(parsed);
    return true;
}

bool parseU8Param(const char* name, uint8_t minValue, uint8_t maxValue, uint8_t& out) {
    uint32_t parsed = 0;
    if (!parseU32Param(name, minValue, maxValue, 0, parsed)) {
        return false;
    }
    out = static_cast<uint8_t>(parsed);
    return true;
}

bool parseFlowRateParam(const char* name, uint32_t minMlPerMin, uint32_t maxMlPerMin, uint32_t fallbackMlPerMin, uint32_t& out) {
    char value[24];
    if (!Esp32BaseWeb::getParam(name, value, sizeof(value)) || value[0] == '\0') {
        out = fallbackMlPerMin;
        return true;
    }

    uint32_t wholeLiters = 0;
    uint32_t fractionalMl = 0;
    uint8_t fractionalDigits = 0;
    bool sawDigit = false;
    bool inFraction = false;
    for (size_t i = 0; value[i] != '\0'; ++i) {
        const char c = value[i];
        if (c == '.') {
            if (inFraction) {
                return false;
            }
            inFraction = true;
            continue;
        }
        if (c < '0' || c > '9') {
            return false;
        }
        sawDigit = true;
        if (inFraction) {
            if (fractionalDigits >= 3) {
                return false;
            }
            fractionalMl = fractionalMl * 10UL + static_cast<uint32_t>(c - '0');
            ++fractionalDigits;
        } else {
            wholeLiters = wholeLiters * 10UL + static_cast<uint32_t>(c - '0');
            if (wholeLiters > 100000UL) {
                return false;
            }
        }
    }
    if (!sawDigit) {
        return false;
    }
    while (fractionalDigits < 3) {
        fractionalMl *= 10UL;
        ++fractionalDigits;
    }

    const uint64_t mlPerMin = static_cast<uint64_t>(wholeLiters) * 1000ULL + fractionalMl;
    if (mlPerMin < minMlPerMin || mlPerMin > maxMlPerMin) {
        return false;
    }
    out = static_cast<uint32_t>(mlPerMin);
    return true;
}

bool parseMinuteParam(const char* name, bool enabled, uint16_t& out) {
    char value[8];
    if (!Esp32BaseWeb::getParam(name, value, sizeof(value)) || value[0] == '\0') {
        out = kInvalidMinuteOfDay;
        return !enabled;
    }
    if (strlen(value) != 5 || value[2] != ':' ||
        value[0] < '0' || value[0] > '9' ||
        value[1] < '0' || value[1] > '9' ||
        value[3] < '0' || value[3] > '9' ||
        value[4] < '0' || value[4] > '9') {
        return false;
    }
    const uint8_t hour = static_cast<uint8_t>((value[0] - '0') * 10 + (value[1] - '0'));
    const uint8_t minute = static_cast<uint8_t>((value[3] - '0') * 10 + (value[4] - '0'));
    if (hour > 23 || minute > 59) {
        return false;
    }
    out = static_cast<uint16_t>(hour) * 60U + minute;
    return true;
}

void minuteToText(uint16_t minuteOfDay, char* out, size_t len) {
    if (!isValidMinuteOfDay(minuteOfDay)) {
        snprintf(out, len, "");
        return;
    }
    snprintf(out, len, "%02u:%02u", minuteOfDay / 60U, minuteOfDay % 60U);
}

void epochToText(uint32_t epoch, char* out, size_t len) {
    if (epoch == 0 || !Esp32BaseTime::formatEpoch(epoch, out, len, "%Y-%m-%d %H:%M")) {
        snprintf(out, len, "无");
    }
}

void flowRateToText(uint32_t mlPerMin, char* out, size_t len) {
    const uint32_t whole = mlPerMin / 1000UL;
    const uint32_t fractional = mlPerMin % 1000UL;
    if (fractional == 0) {
        snprintf(out, len, "%lu", static_cast<unsigned long>(whole));
        return;
    }
    char text[24];
    snprintf(text, sizeof(text), "%lu.%03lu",
             static_cast<unsigned long>(whole),
             static_cast<unsigned long>(fractional));
    size_t n = strlen(text);
    while (n > 0 && text[n - 1] == '0') {
        text[--n] = '\0';
    }
    snprintf(out, len, "%s", text);
}

void sendEscapedValue(const char* value) {
    Esp32BaseWeb::writeHtmlEscaped(value != nullptr ? value : "");
}

void sendChecked(bool checked) {
    if (checked) {
        Esp32BaseWeb::sendChunk(" checked");
    }
}

void sendToggleInput(const char* name, bool checked) {
    Esp32BaseWeb::sendChunk("<label class='ir-toggle'><input type='checkbox' name='");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("' value='1'");
    sendChecked(checked);
    Esp32BaseWeb::sendChunk("><span></span></label>");
}

void sendTextInput(const char* name, const char* value, uint8_t maxLength) {
    char buf[192];
    snprintf(buf, sizeof(buf), "<input name='%s' maxlength='%u' value='", name, maxLength);
    Esp32BaseWeb::sendChunk(buf);
    sendEscapedValue(value);
    Esp32BaseWeb::sendChunk("'>");
}

