tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void sendNumberInput(const char* name, uint32_t value, uint32_t minValue, uint32_t maxValue) {
    char buf[128];
    snprintf(buf, sizeof(buf), "<input type='number' name='%s' min='%lu' max='%lu' value='%lu'>",
             name,
             static_cast<unsigned long>(minValue),
             static_cast<unsigned long>(maxValue),
             static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(buf);
}

void sendFlowRateInput(const char* name, uint32_t mlPerMin, uint32_t minMlPerMin, uint32_t maxMlPerMin) {
    char value[24];
    char minValue[24];
    char maxValue[24];
    flowRateToText(mlPerMin, value, sizeof(value));
    flowRateToText(minMlPerMin, minValue, sizeof(minValue));
    flowRateToText(maxMlPerMin, maxValue, sizeof(maxValue));
    char buf[192];
    snprintf(buf, sizeof(buf), "<input type='number' name='%s' min='%s' max='%s' step='0.001' value='%s'>",
             name,
             minValue,
             maxValue,
             value);
    Esp32BaseWeb::sendChunk(buf);
}

void sendSettingToggle(const char* title, const char* desc, const char* name, bool checked) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendToggleInput(name, checked);
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendSettingNumber(const char* title,
                       const char* desc,
                       const char* unit,
                       const char* name,
                       uint32_t value,
                       uint32_t minValue,
                       uint32_t maxValue) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendNumberInput(name, value, minValue, maxValue);
    Esp32BaseWeb::sendChunk("<span class='ir-unit'>");
    Esp32BaseWeb::sendChunk(unit);
    Esp32BaseWeb::sendChunk("</span></div></div>");
}

void sendSettingFlowRate(const char* title,
                         const char* desc,
                         const char* name,
                         uint32_t value,
                         uint32_t minValue,
                         uint32_t maxValue) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendFlowRateInput(name, value, minValue, maxValue);
    Esp32BaseWeb::sendChunk("<span class='ir-unit'>L/min</span></div></div>");
}

void sendContactTypeChoice(ContactType type) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>低液位触点类型</span><span class='ir-setting-desc'>按实际缺水传感器接线选择：常开 NO 或常闭 NC。</span></div><div class='ir-control'><div class='ir-choice'>");
    Esp32BaseWeb::sendChunk("<label><input type='radio' name='lowLevelContactType' value='normally_open'");
    sendChecked(type == ContactType::NormallyOpen);
    Esp32BaseWeb::sendChunk(">常开 NO</label><label><input type='radio' name='lowLevelContactType' value='normally_closed'");
    sendChecked(type == ContactType::NormallyClosed);
    Esp32BaseWeb::sendChunk(">常闭 NC</label></div></div></div>");
}

void sendSectionStart(const char* title, const char* note) {
    Esp32BaseWeb::sendChunk("<div class='ir-section'><h3 class='ir-section-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</h3><p class='ir-section-note'>");
    Esp32BaseWeb::sendChunk(note);
    Esp32BaseWeb::sendChunk("</p><div class='ir-setting-list'>");
}

void sendSectionEnd() {
    Esp32BaseWeb::sendChunk("</div></div>");
}

uint32_t maxZoneDurationMinutes();

void sendEnabledPill(bool enabled) {
    Esp32BaseWeb::sendChunk(enabled ? "<span class='ir-pill on'>启用</span>" : "<span class='ir-pill'>禁用</span>");
}

uint32_t durationMinutesRounded(uint32_t seconds) {
    return (seconds + 59UL) / 60UL;
}

uint32_t msToSecondsRounded(uint32_t milliseconds) {
    return (milliseconds + 999UL) / 1000UL;
}

uint8_t planEnabledZoneCount(const IrrigationConfig& config, const WateringPlan& plan) {
    uint8_t count = 0;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled && plan.zoneDurationSec[i] > 0) {
            ++count;
        }
    }
    return count;
}

uint32_t planTotalDurationSec(const IrrigationConfig& config, const WateringPlan& plan) {
    uint32_t total = 0;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled) {
            total += plan.zoneDurationSec[i];
        }
    }
    return total;
}

uint8_t zonePlanUseCount(const IrrigationConfig& config, uint8_t zoneId) {
    uint8_t count = 0;
    const uint8_t zoneIndex = zoneIndexFromId(zoneId);
    if (zoneIndex >= kMaxZones) {
        return 0;
    }
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (plan.used && plan.zoneDurationSec[zoneIndex] > 0) {
            ++count;
        }
    }
    return count;
}

uint8_t firstEnabledZoneId(const IrrigationConfig& config) {
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled) {
            return config.zones[i].id;
        }
    }
    return 0;
}

void sendPlanStartSummary(const WateringPlan& plan) {
    bool any = false;
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        if (!plan.startTimes[i].enabled || !isValidMinuteOfDay(plan.startTimes[i].minuteOfDay)) {
            continue;
        }
        if (any) {
            Esp32BaseWeb::sendChunk(" / ");
        }
        char text[8];
        minuteToText(plan.startTimes[i].minuteOfDay, text, sizeof(text));
        Esp32BaseWeb::sendChunk(text);
        any = true;
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("未设置");
    }
}

void sendPlanZoneSummary(const IrrigationConfig& config, const WateringPlan& plan) {
    bool any = false;
    Esp32BaseWeb::sendChunk("<div class='ir-compact-list'>");
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled || plan.zoneDurationSec[i] == 0) {
            continue;
        }
        any = true;
        Esp32BaseWeb::sendChunk("<span class='ir-compact-item'>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk(" ");
        char value[24];
        snprintf(value, sizeof(value), "%lu 分钟", static_cast<unsigned long>(durationMinutesRounded(plan.zoneDurationSec[i])));
        Esp32BaseWeb::sendChunk(value);
        Esp32BaseWeb::sendChunk("</span>");
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<span class='ir-table-note'>未配置有效水路时长</span>");
    }
    Esp32BaseWeb::sendChunk("</div>");
}

bool readRequestZoneId(uint8_t& zoneId) {
    return parseU8Param("id", 1, kMaxZones, zoneId);
}

bool readRequestPlanId(uint8_t& planId) {
    return parseU8Param("id", 1, kMaxPlans, planId);
}

bool readPagingParam(const char* name, uint32_t minValue, uint32_t maxValue, uint32_t fallback, uint32_t& out) {
    return parseU32Param(name, minValue, maxValue, fallback, out);
}

bool readPlanFieldsFromRequest(WateringPlan& plan) {
    char value[kPlanNameLength];
    plan.enabled = parseBoolParam("enabled");
    if (Esp32BaseWeb::getParam("name", value, sizeof(value))) {
        snprintf(plan.name, sizeof(plan.name), "%s", value);
        plan.name[sizeof(plan.name) - 1] = '\0';
    }

    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "se%u", i);
        const bool enabled = parseBoolParam(key);
        snprintf(key, sizeof(key), "st%u", i);
        uint16_t minuteOfDay = kInvalidMinuteOfDay;
        if (!parseMinuteParam(key, enabled, minuteOfDay)) {
            Esp32BaseWeb::sendText(400, "启动时间无效");
            return false;
        }
        plan.startTimes[i].enabled = enabled;
        plan.startTimes[i].minuteOfDay = minuteOfDay;
    }

    for (uint8_t i = 0; i < kMaxZones; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "z%u", i + 1);
        uint32_t minutes = 0;
        if (!parseU32Param(key, 0, maxZoneDurationMinutes(), plan.zoneDurationSec[i] / 60UL, minutes)) {
            Esp32BaseWeb::sendText(400, "水路时长无效");
            return false;
        }
        plan.zoneDurationSec[i] = minutes * 60UL;
    }
    return true;
}

