tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    if (!parseU32Param("noFlowConfirmSec", 1, 600, next.flow.noFlowConfirmSec, value)) {
        Esp32BaseWeb::sendText(400, "无流量确认时间无效");
        return;
    }
    next.flow.noFlowConfirmSec = value;

    if (!parseU32Param("leakWindowSec", 1, 600, next.flow.leakWindowSec, value)) {
        Esp32BaseWeb::sendText(400, "待机漏水检测窗口无效");
        return;
    }
    next.flow.leakWindowSec = value;

    if (!parseU32Param("leakPulseThreshold", 1, 1000, next.flow.leakPulseThreshold, value)) {
        Esp32BaseWeb::sendText(400, "待机漏水脉冲阈值无效");
        return;
    }
    next.flow.leakPulseThreshold = value;

    if (!parseU32Param("lowFlowPercent", 1, 100, next.flow.lowFlowPercent, value)) {
        Esp32BaseWeb::sendText(400, "低流量百分比无效");
        return;
    }
    next.flow.lowFlowPercent = static_cast<uint8_t>(value);

    if (!parseU32Param("highFlowPercent", 100, 1000, next.flow.highFlowPercent, value)) {
        Esp32BaseWeb::sendText(400, "高流量百分比无效");
        return;
    }
    next.flow.highFlowPercent = static_cast<uint16_t>(value);

    if (!parseU32Param("lowHighFlowConfirmSec", 1, 600, next.flow.lowHighFlowConfirmSec, value)) {
        Esp32BaseWeb::sendText(400, "异常流量确认时间无效");
        return;
    }
    next.flow.lowHighFlowConfirmSec = value;

    if (!parseU32Param("pullInSec", 1, 60, msToSecondsRounded(next.valve.pullInMs), value)) {
        Esp32BaseWeb::sendText(400, "电磁阀吸合时间无效");
        return;
    }
    next.valve.pullInMs = value * 1000UL;

    if (!parseU32Param("holdPercent", 1, 100, next.valve.holdPercent, value)) {
        Esp32BaseWeb::sendText(400, "电磁阀保持占空比无效");
        return;
    }
    next.valve.holdPercent = static_cast<uint8_t>(value);

    if (!parseU32Param("maxZoneDurationMin", 1, 360, next.valve.maxZoneDurationSec / 60UL, value)) {
        Esp32BaseWeb::sendText(400, "单路最大浇水时长无效");
        return;
    }
    next.valve.maxZoneDurationSec = value * 60UL;

    if (!ConfigStore::save(next)) {
        Esp32BaseWeb::sendText(400, ConfigStore::lastError());
        return;
    }
    BoardHardware::configure(ConfigStore::config().valve, ConfigStore::config().supply);
    Esp32BaseWeb::redirectSeeOther("/irrigation/settings");
}

void sendRunPanel() {
    Esp32BaseWeb::beginPanel("手动浇水");
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/run/start'><div class='ir-run-list'>");
    const IrrigationConfig& config = ConfigStore::config();
    const uint32_t maxMinutes = maxZoneDurationMinutes();
    bool any = false;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        any = true;
        Esp32BaseWeb::sendChunk("<div class='ir-run-row'><div><b>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</b><span class='ir-help'>本次手动任务会按水路编号顺序执行，填 0 表示跳过。</span></div><div class='ir-input-unit'>");
        char key[8];
        snprintf(key, sizeof(key), "z%u", zone.id);
        sendNumberInput(key, 0, 0, maxMinutes);
        Esp32BaseWeb::sendChunk("<span class='ir-unit'>分钟</span></div></div>");
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>还没有启用水路，请先到水路页面启用实际接线的水路。</div>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='启动手动浇水'");
    if (!any) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></form>");
    Esp32BaseWeb::endPanel();
}

void sendPlanNowPanel() {
    const IrrigationConfig& config = ConfigStore::config();
    bool hasPlan = false;
    const bool flowReady = config.flow.pulsesPerLiter > 0;
    Esp32BaseWeb::beginPanel("立即执行计划");
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/run/plan-now'><div class='ir-field'><label>选择计划</label><span class='ir-help'>立即按所选计划的水路时长顺序执行，不等待计划启动时间。</span><select name='plan'>");
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used || !plan.enabled) {
            continue;
        }
        hasPlan = true;
        char buf[80];
        snprintf(buf, sizeof(buf), "<option value='%u'>", plan.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(plan.name);
        Esp32BaseWeb::sendChunk("</option>");
    }
    Esp32BaseWeb::sendChunk("</select></div><div class='actions'><input type='submit' value='立即执行所选计划'");
    if (!hasPlan || !flowReady) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></form>");
    if (!hasPlan) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "没有已启用的计划", "先启用一个计划，才能使用立即执行。");
    } else if (!flowReady) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "流量计未校准", "执行自动计划前需要先设置每升脉冲数。");
    }
    Esp32BaseWeb::endPanel();
}

void handleDashboardPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    char value[32];

    Esp32BaseWeb::sendHeader("智能浇水");
    Esp32BaseWeb::sendPageTitle("智能浇水", "本地 12V 六路浇水控制器");
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("运行状态", runStateLabel(status.runState), status.busy ? "正在运行" : "空闲");
    snprintf(value, sizeof(value), "%u / %u", status.enabledZoneCount, kMaxZones);
    Esp32BaseWeb::sendMetric("已启用水路", value, "硬件最多 6 路");
    snprintf(value, sizeof(value), "%u / %u", status.enabledPlanCount, kMaxPlans);
    Esp32BaseWeb::sendMetric("已启用计划", value, "每日计划");
    epochToText(status.nextRunEpoch, value, sizeof(value));
    Esp32BaseWeb::sendMetric("下次运行", value, status.nextRunEpoch == 0 ? "没有已启用的计划" : "本地时间");
    Esp32BaseWeb::endMetricGrid();
    Esp32BaseWeb::beginPanel("当前概览");
    Esp32BaseWeb::sendChunk("<div class='ir-kv'>");
    Esp32BaseWeb::sendChunk("<div><b>");
    Esp32BaseWeb::sendChunk(status.configValid ? "正常" : "异常");
    Esp32BaseWeb::sendChunk("</b><span>配置状态</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().flow.pulsesPerLiter > 0 ? "已校准" : "未校准");
    Esp32BaseWeb::sendChunk("</b><span>流量计</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().supply.pumpEnabled ? "启用" : "禁用");
    Esp32BaseWeb::sendChunk("</b><span>外部自吸泵供水</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().supply.lowLevelEnabled ? "启用" : "禁用");
    Esp32BaseWeb::sendChunk("</b><span>低液位保护</span></div></div>");
    if (ConfigStore::config().flow.pulsesPerLiter == 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "流量计未校准", "自动计划执行前需要先设置每升脉冲数。");
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleRunPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    Esp32BaseWeb::sendHeader("运行");
    Esp32BaseWeb::sendPageTitle("运行", "手动顺序浇水和立即执行计划");
    char value[32];
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("运行状态", runStateLabel(status.runState), status.busy ? "正在运行" : "空闲");
    snprintf(value, sizeof(value), "%u", status.activeZoneId);
    Esp32BaseWeb::sendMetric("当前水路", value, status.activeZoneId == 0 ? "无" : "已打开");
    flowRateToText(status.currentFlowMlPerMin, value, sizeof(value));
    Esp32BaseWeb::sendMetric("当前流量", value, "L/min 估算值");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(status.currentRunVolumeMl));
    Esp32BaseWeb::sendMetric("累计水量 ml", value, "当前步骤");
    Esp32BaseWeb::endMetricGrid();
    if (status.busy) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "正在运行", runStateLabel(status.runState));
        Esp32BaseWeb::beginPanel("停止运行");
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/run/stop'><div class='actions'><input class='danger' type='submit' value='停止浇水'></div></form>");
        Esp32BaseWeb::endPanel();
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "空闲", "当前没有正在执行的浇水任务。");
    }
    sendRunPanel();
    sendPlanNowPanel();
    Esp32BaseWeb::sendFooter();
}

