tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void sendCalibrationResultPanel(const CalibrationSnapshot& snapshot) {
    if (!snapshot.resultReady) {
        return;
    }

    char buf[768];
    Esp32BaseWeb::beginPanel("校准结果");
    snprintf(buf,
             sizeof(buf),
             "<div class='ir-calib-result'><div><b>%s</b><span>校准类型</span></div><div><b>水路 %u</b><span>本次校准水路</span></div><div><b>%lu</b><span>累计脉冲数</span></div></div>",
             calibrationModeLabel(snapshot.mode),
             snapshot.zoneId,
             static_cast<unsigned long>(snapshot.pulses));
    Esp32BaseWeb::sendChunk(buf);

    if (snapshot.mode == CalibrationMode::FlowMeterVolume) {
        Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='save_volume'><div class='ir-field'><label>实测水量</label><span class='ir-help'>填写本次实际接到的水量，系统据此计算每升脉冲数。</span><div class='ir-input-unit'><input type='number' name='measuredMl' min='1' max='100000' value='1000'><span class='ir-unit'>ml</span></div></div><div class='actions'><input type='submit' value='保存每升脉冲数'></div></form>");
    } else if (snapshot.mode == CalibrationMode::ZoneStandardFlow) {
        char flowText[24];
        flowRateToText(snapshot.suggestedFlowMlPerMin, flowText, sizeof(flowText));
        snprintf(buf, sizeof(buf), "<form class='ir-form' method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='save_standard'><input type='hidden' name='zone' value='%u'><div class='ir-field'><label>标准流量</label><span class='ir-help'>保存后用于该水路的低流量和高流量判断。</span><div class='ir-input-unit'><input type='number' name='standardFlow' min='0.001' max='100' step='0.001' value='%s'><span class='ir-unit'>L/min</span></div></div><div class='actions'><input type='submit' value='保存水路标准流量'></div></form>",
                 snapshot.zoneId,
                 flowText);
        Esp32BaseWeb::sendChunk(buf);
        if (snapshot.suggestedFlowMlPerMin == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "需要手动填写", "需要一次已完成的运行记录和每升脉冲数，才能自动建议标准流量。");
        }
    }

    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='clear'><div class='actions'><input type='submit' value='丢弃结果'></div></form>");
    Esp32BaseWeb::endPanel();
}

void handleCalibrationPage() {
    const CalibrationSnapshot snapshot = CalibrationService::snapshot();
    const IrrigationConfig& config = ConfigStore::config();

    Esp32BaseWeb::sendHeader("校准");
    Esp32BaseWeb::sendPageTitle("校准", "流量计和水路标准流量");

    Esp32BaseWeb::beginMetricGrid();
    char value[32];
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(config.flow.pulsesPerLiter));
    Esp32BaseWeb::sendMetric("每升脉冲数", value, config.flow.pulsesPerLiter == 0 ? "未校准" : "已保存");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(snapshot.pulses));
    Esp32BaseWeb::sendMetric("当前脉冲数", value, calibrationModeLabel(snapshot.mode));
    snprintf(value, sizeof(value), "%u", snapshot.zoneId);
    Esp32BaseWeb::sendMetric("校准水路", value, snapshot.running ? "正在运行" : "空闲");
    Esp32BaseWeb::endMetricGrid();

    if (snapshot.running) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "正在校准", "接够水后可以手动停止，也可以等待设定时长结束。");
        Esp32BaseWeb::beginPanel("停止校准");
        Esp32BaseWeb::sendChunk("<div class='ir-calib-result'><div><b>");
        Esp32BaseWeb::sendChunk(calibrationModeLabel(snapshot.mode));
        Esp32BaseWeb::sendChunk("</b><span>当前模式</span></div><div><b>");
        snprintf(value, sizeof(value), "水路 %u", snapshot.zoneId);
        Esp32BaseWeb::sendChunk(value);
        Esp32BaseWeb::sendChunk("</b><span>正在出水</span></div><div><b>");
        snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(snapshot.pulses));
        Esp32BaseWeb::sendChunk(value);
        Esp32BaseWeb::sendChunk("</b><span>已累计脉冲</span></div></div>");
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='stop'><div class='actions'><input class='danger' type='submit' value='停止校准'></div></form>");
        Esp32BaseWeb::endPanel();
    } else {
        sendCalibrationResultPanel(snapshot);
        Esp32BaseWeb::beginPanel("校准流程");
        Esp32BaseWeb::sendChunk("<div class='ir-calib-steps'><div class='ir-calib-step'><span class='ir-step-no'>1</span><div><b>校准流量计</b><span class='ir-help'>运行任意已启用水路，接取实际水量，保存每升脉冲数。</span></div></div><div class='ir-calib-step'><span class='ir-step-no'>2</span><div><b>校准水路标准流量</b><span class='ir-help'>每个水路单独运行，保存正常出水时的 L/min，供异常流量判断使用。</span></div></div><div class='ir-calib-step'><span class='ir-step-no'>3</span><div><b>回到水路页复核</b><span class='ir-help'>确认各水路标准流量已写入；浇水时长仍在手动任务或计划中设置。</span></div></div></div>");
        Esp32BaseWeb::endPanel();
        sendCalibrationStartPanel();
    }

    Esp32BaseWeb::sendFooter();
}

void eventTimeToText(const Esp32BaseAppEventRecord& event, char* out, size_t len) {
    if (event.epochSec != 0 && Esp32BaseTime::formatEpoch(event.epochSec, out, len, "%Y-%m-%d %H:%M")) {
        return;
    }
    snprintf(out, len, "启动后 %lus", static_cast<unsigned long>(event.uptimeSec));
}

void writeEventObjectText(const char* value, size_t maxLen) {
    char text[64];
    size_t n = 0;
    while (n < maxLen && value[n] != '\0' && n < sizeof(text) - 1) {
        text[n] = value[n];
        ++n;
    }
    text[n] = '\0';
    if (strcmp(text, "controller") == 0) {
        Esp32BaseWeb::sendChunk("控制器");
    } else if (strcmp(text, "run") == 0) {
        Esp32BaseWeb::sendChunk("浇水任务");
    } else if (strcmp(text, "zone") == 0) {
        Esp32BaseWeb::sendChunk("水路");
    } else if (strcmp(text, "flow") == 0) {
        Esp32BaseWeb::sendChunk("流量计");
    } else if (strncmp(text, "plan:", 5) == 0) {
        Esp32BaseWeb::sendChunk("计划 ");
        Esp32BaseWeb::writeHtmlEscaped(text + 5);
    } else if (text[0] == '\0') {
        Esp32BaseWeb::sendChunk("无");
    } else {
        Esp32BaseWeb::writeHtmlEscaped(text);
    }
}

void sendEventTableRow(const Esp32BaseAppEventRecord& event, void* user) {
    bool* any = static_cast<bool*>(user);
    if (any != nullptr) {
        *any = true;
    }
    char timeText[24];
    eventTimeToText(event, timeText, sizeof(timeText));
    char buf[160];
    snprintf(buf,
             sizeof(buf),
             "<tr><td class='num'>%lu</td><td>%s</td><td>%s</td><td>%s</td><td>%s</td><td>",
             static_cast<unsigned long>(event.id),
             eventLevelLabel(event.level),
             eventSourceLabel(event.source),
             eventTypeLabel(event.type),
             eventReasonLabel(event.reason));
    Esp32BaseWeb::sendChunk(buf);
    writeEventObjectText(event.object, sizeof(event.object));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(timeText);
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void sendEventsTable(uint32_t page, uint32_t perPage, uint32_t total) {
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='ir-data-table'><thead><tr><th class='num'>编号</th><th>级别</th><th>来源</th><th>事件</th><th>原因</th><th>对象</th><th>时间</th></tr></thead><tbody>");
    bool any = false;
    const uint32_t offset = (page - 1U) * perPage;
    if (offset <= 65535UL && perPage <= 65535UL) {
        Esp32BaseAppEventLog::readLatest(static_cast<uint16_t>(offset), static_cast<uint16_t>(perPage), sendEventTableRow, &any);
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='7'>暂无可显示的事件</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");

    Esp32BaseWeb::Pagination pagination = {"/irrigation/events", "", page, perPage, total};
    Esp32BaseWeb::sendPagination(pagination);
}

void sendHistoryTable(char* historyText) {
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='ir-data-table'><thead><tr><th class='num'>编号</th><th>来源</th><th>结果</th><th>原因</th><th>开始时间</th><th>结束时间</th><th class='num'>步骤数</th></tr></thead><tbody>");

